#include"cplan.h"
#include<cmath>
#include<iostream>
using namespace std;


/////////////////////////////////////余弦曲线///////////////////////////////////////////////
////功能：生成余弦曲线，振幅a和角频率w及运行时间t由用户自定义
//输入：时间，每毫秒计数一次，注意单位转换
//输出：当前时刻s的值
//------------------------------------------------------------------------------------------

                            
//==================================获取余弦曲线当下的值===================================//
auto cosCurve::getCurve(int count)->double
{
	int t = count + 1;
	double s = 0;

    //s = a_ * (1-(std::cos( w_ * t / 1000.0)) );
    //s = a_ * (1-std::cos(w_ * t / 1000.0 + p_));
    s = a_ * std::cos(w_ * t / 1000.0 + p_) ;

    return s;
}

